
// {{Слукина М.Н.  заполнение реквизита Ответственный текущим пользователем. реализовать алгоритм заполнения документа

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();

	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
		// Заполнение шапки
		Договор = ДанныеЗаполнения.Договор;
		Комментарий = ДанныеЗаполнения.Комментарий;
		Контрагент = ДанныеЗаполнения.Контрагент;
		Организация = ДанныеЗаполнения.Организация;
		Ответственный = ДанныеЗаполнения.Ответственный;
		Основание = ДанныеЗаполнения.Ссылка;
		Для Каждого ТекСтрокаТовары Из ДанныеЗаполнения.Товары Цикл
			НоваяСтрока = Товары.Добавить();
			НоваяСтрока.Количество = ТекСтрокаТовары.Количество;
			НоваяСтрока.Номенклатура = ТекСтрокаТовары.Номенклатура;
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти  

#КонецЕсли

	// }}
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	// Реализуйте регистрацию документа «Доставка» на всех узлах плана обмена, 
	//у которых значение реквизита «Пользователь» заполнено и соответствует 
	//значению реквизита «Ответственный документа»  
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
 
	Запрос = Новый Запрос;
	Запрос.Текст ="ВЫБРАТЬ
	              |	ОбменСМобильнымПриложением.Ссылка КАК Ссылка
	              |ИЗ
	              |	ПланОбмена.ОбменСМобильнымПриложением КАК ОбменСМобильнымПриложением
	              |ГДЕ
	              |	ОбменСМобильнымПриложением.Пользователь = &Пользователь
	              |	И НЕ ОбменСМобильнымПриложением.ПометкаУдаления";
	
	Запрос.УстановитьПараметр("Пользователь", Ответственный);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		ОбменДанными.Получатели.Добавить(Выборка.Ссылка);
	КонецЦикла; 
				  
КонецПроцедуры
	
	